#include <iostream>
#include "Plurar.h"
using namespace std;

/*
* Варіант 14
*
* Розробити клас "Множина" для представлення множини цілих чисел. Реалізувати
* для нього декілька конструкторів, геттери, метод визначення приналежності
* заданного елемента множині. Перевантажити оператори "+", "*" та "-" для знаходження
* об'єднання, перетину і різниці множин відповідно. Створити дві множини
* (A, B), використовуючи різні конструктори. На їх основі побудувати множину 
* C = (A U B) \ (A ∩ B)
*/

int main()
{
    int leng;
    cout << "Enter leng of A : ";
    cin >> leng;
    Plural A(leng), B;
    cout << "A:";
    A.output_numbers();
    cout << "B:";
    B.output_numbers();
    Plural C = (A + B) - (A * B);
    cout << "C:";
    C.output_numbers();
}